{"0 - 295.363": "- Ladies and gentlemen, this is the mument we've\nall been waiting for. Welcome to what might be the greatest 20 versus 1 ever. IShowMeat. I mean, IShowSpeed is the worldwide streaming phenomenon everyone is talking about, especially because he can't even score in a Sidemen Charity match. But anyway, we've put him in the same room as 20 beautiful women. Does he know how to talk to them? Probably not. But the Sidemen will guide\nhim towards true love or absolute disaster. But before we get into the video, can we please ask you to subscribe? We do so many amazing videos and we've set the goal at 20 million by the end of the year. Help us do it. Now, enjoy. Speed, 20 versus 1. - Have you got a type? - My type is you. - He looks like a cartoon. - It's the haircut. His hair looks like it's Lego-ed on. - Black Bart Simpson. [Sidemen laughing] - Okay. Okay. Okay. - Hi. - How are you doing? - I'm good. - Oh, we get to hug, okay. - Ooh. - My name's [indistinct] and I'm 20 and I'm a care assistant. - You a care assistant? - Yeah. - What are you? - Ethnicity? - Yeah, yeah, yeah. - Mauritian Indian. - What are you? - Oh, so you Indian? - Yeah. - You speak Hindi? - I understand a little bit. - Brudda, say yes or no. What are we doing? - Now what's next? [Sidemen laughing] - You say yes or no. - Oh, yes or no. Okay. You mind if I sniff you? - Sure. - Bro. [Speed sniffing] - Wait! - Yes, yes, yes. - I'll see you later. - I'll see you later. - If he did that and said no. - Oh, my God. - Did I not just ask you to subscribe? Do you want us to never reach 20 million? Is there something wrong with you? Are you a d*ckhead? Is there something wrong with your brain? Subscribe and get us to 20 million. Thank you. - Where you from? - I'm from London. - You from London? - Yeah. - Actually? - She was struggling to walk. - What is that? - What? - Like, actually look at that mark right there. You don't see that? - No. - What? It's like a little black mark. - Oh. - Okay. - My God. - I didn't even give you a hug. - Yeah, give me a hug. - How are you? - I'm doing good. - I'm finished! - How old are you? - I'm 22. - You're 22? - 22 where? - How old are you? - I'm 21. - Oh, you're 21? - Yeah, I'm 21. Yeah, I'm 21. So, look, where I'm from, you know, Portugal- - Are you Portuguese? - Yes. - Oh, really? - Yes, Portuguese. [Sidemen laughing] What we do when people greet each other, you know, and I'll really appreciate it 'cause this is like my culture, you know, I don't play about my Portugal culture. - Yeah, yeah. - So, you know, it's this greeting we do. We go, \"Hey, Speed. How you doing?\" [Sidemen laughing] - Oh, my God. - So you come to me and you say, \"Hey, Speed. How you doing?\" - Hey, Speed. - No, the other way. - Oh, oh, oh. Hey, Speed. How you doing? [Sidemen laughing] - Okay. Thank you so much. Yes, yes, yes. - I've just snorted. [Sidemen laughing] - Hi, nice to meet you. I'm Anisah, I'm 21 and I'm a nurse. - You a nurse? - Yeah. - My heart. [Sidemen laughing] Heal me out real quick. - Do you want me to do CPR? - Yeah. - Do I have permission? - Yeah, you got permission. [Sidemen laughing] Oh, yeah. You a good nurse. How old are you? - I'm 21. - And where are you from? - I'm Bengali. - Where's that? Where's that? - It's like next to India. South Asia? - Oh, so you're Indian too? - Oh, my God. - Bengali. - Bengali? - Yeah. - All right. Lemme ask you a question, all right? See, me, personally, I'm a Messi fan. You know what I mean? But, you know, I like to ask this to a lot of people. Ronaldo or Messi? - Messi fan? - He's setting her up. - Ronaldo. - Yes! - I also love Rafael Leao, as well. - Really? - He's in love. - I love Rafael Leao. - Give me a hug. - Did you see how he was in the World Cup? [crosstalk] - Okay, what number is he? - Brudda, say yes or no! - Okay, I'm not that much of a fan. I love watching World Cup. - Okay. Yes, yes, yes. She's valid. - Thank you. - She valid. She valid. - Nice to meet you. - Nice to meet you too, Bengali. [Sidemen laughing] - Bengali. - Oh, hey. - I'm your Barbie for today. - She's taller than him. - You look like a Barbie too. Yeah, I used to, like, play with Barbies all the time when I was younger. - Oh, my God. - Did you? - What'd you do with Barbies? - What do you do, Barbie Girl? - So, I'm a dancer. - Ooh, let me see a move. - Ooh, what do you mean? Kind of, like, sassy? - sh*t. - I've seen that in \"GTA.\" - \"Hey, baby, pick me up.\" [Sidemen laughing] - \"Wanna go for a ride?\" - Used to be a Zumba instructor. - What? - Zumba instructor. - What the hell? - It's just cringe now, mate. - I don't like it!", "295.363 - 595.2289999999999": "brilliant move from you. Make this man happy. You feel what I'm saying? - I'd love to make you happy. - Yeah. Make me happy. - What is she doing? - Is it over yet? - No. - He's not happy. Yeah, what did you say? - Wait. Is he talking to his penis? - Get her out? Why? She's cute. - I'm cute. - Wait, he's talking. - Ooh. [Sidemen laughing] - She's listening. She's listening. - \"No, get her out!\" Okay. I'm sorry. - Oh, sh*t. Okay. - Why? - Bro's talking to his meat. - He's not happy for some reason. I don't know why. - Are you happy, though? That's the question. - Yeah, I mean- - Accept the no! - Security! - Wait, can I say yes to every girl? - No! - Okay, yes, then. Why not? - No! - Brilliant. - What the hell? - You have brilliant moves. I like the moves. - Ain't no way, bro. - All right. You know what? It's time to be more, you know, what's that word called? Dictatorship. No, not dictatorship. - What? - Analytic- Somebody help me out. - What you saying? - I have to be more decisive. I have to be more- - That's neither one. - Dictatorship. - Hello. How you doing? - I'm good. How are you? - Hell no! - Huh? - Hell no! - Oh. - No, I'm trolling. Oh, my God, did I scare you? - A little bit. I wasn't ready for that. You started screaming at me. - Yeah. My fault, my fault. All right, if you could rate me 1 through 10, like, just be honest. - The shoes ruin it. I'm gonna go 7.6. - She's got to go. - It's gotta be a no. - No. 7.8. - Just say no. - So, like, okay, what do you do? - No, man. - Deal with him. - Do you know what a bouncer is? - No. - So I'm security at a club. - Oh, you security? - Yeah. - All right, so, stop me. - No. - He's done the dates already. - Bro is doing the date bit now. - If you security, so, stop me. Okay, oh, yeah. - What are they doing? - Brudda, how long do you want to take? We don't have all day! Just say yes or no! - Don't pressure him. - Stop wasting our time! - It's my first time! - Stop asking questions! Yes. No. Done. - Okay. No. [Sidemen laughing] 5, 4, 3, 2, 1. No! Now I feel bad, bro. - Well, deal with it. - Sorry. - Yeah, you will be. - Oh! - I'm Mia. - Oh, really? - Yeah, I'm am. - f*ckin' hell. - That's Danny Aarons' posture. - Oh, my God. That is so rude. - Okay, so I have to speed it up 'cause, you know, KSI, you know. - I can't not see it now. I just see Danny Aarons there. - Yeah. [Sidemen laughing] - Fanny Aarons. [Sidemen laughing] - Nah, Ethan! - All right. Turn around. Turn around. - Oh, no. - No, no, no. - No? - What's Danny doing? - I'm sorry. No. - Really? That's crazy. - He made her spin and said no. - During the spin. - That looks like my ass out there. - Fanny Aarons. [Speed mumbling] - It's all right. You can do it again. [Speed speaking Portuguese] - Portuginese. [Speed speaking Portuguese] - Okay. Where you from? - Nigeria and Senegal. - Nigerian? - Nigeria! Whoo! - Whoo! - Yes! [Sidemen laughing] - You know Osimhen? - No, I don't. - No. - No! - What? - I'm sorry. - Okay, well, that's fine. - Like, I wish I'd get to know you, but I'm in a rush. - Yeah, bro. - Damn. - That one hurt him. - How are you? - Hi. I'm good, thanks. - Gimme a handshake. Whereabout are you? - Whereabout am I? [Sidemen laughing] Now? - Yeah. - Here. [Sidemen laughing] - In the studio. - In front of you. - No. [Sidemen laughing] - Hello. - Hey. Nice to to meet you. - How are you? You feeling better? - Yes, I'm feeling better. - Who's your favourite\nPremier League club? - Bro is fanning his shirt. - Ronaldo. - Yes. - Just say Ronaldo. - Just Ronaldo, yeah. - Okay. How old are you? - 21. - What you do? - I'm a dancer. - Lemme see a move real quick. - Do you wanna see an acro trick? - Yeah, yeah, yeah, yeah. - Let's see it. Oh, wow. - So you're acrobatic. Yeah, yeah, yeah. Yes, yes, yes. - Oh, I know where this could go. - All right, come on. - Hello. - Oh, sh*t. - Whoa. - You a gymnastics. - You a gymnastics. [Sidemen laughing] - He speaks like babies do, like, broken English. - You have a favourite football player? - Ronaldo. - Yes. Yes. - You say yes? - Yes. [Sidemen laughing] - To be fair, she came in with the flip. - Yeah, gotta respect it. - Well, I got a question. Can KSI see me right now? f*ck you, KSI. [beep] you wherever you at. - Why is she swearing me? - you, KSI. - you, KSI. - What's going on? - you, you big forehead mother[beep]. - Don't make me come down there again. - Pussy. - d*ckhead. - About to talk to some\ngood looking females, you feel what I'm saying? [upbeat music] - I might flash him my tits. - You just gonna go for the tits? - I'm fully just gonna flash him my tits. - So I was like, \"Please sniff me.\" - The first thing was, \"Oh, my God, are you flexible?\" Yes. - Sewey! - Make that extra moisture for him. - How are you?", "595.2289999999999 - 896.516": "How are you? - I'm doing fine. I'm doing fine. You know who you remind me of? - Go on. - Like a witch. - I've had better, but okay, I'll take it. - It's not a nice thing to say. - No, it's not in a bad way. Like a good witch. - Like a sandwich. - But what do you do, though? - I'm a dancer. - All right. What kind of dancer? - I'm hip hop and commercial and heels. - Hip hop and commercial and heels. No. - Ooh. It's okay. - Why did she say, \"Ooh,\" and then pose? - She's threw her hip out, innit? - Sound like Callux. [Sidemen laughing] - Damn, I feel bad, bro. Damn. Where are you from? - I'm from Newcastle. - What do you do? - I've just graduated. I did forensic science. - Forensic science. What's that? - Looking at, like, blood patterns and stuff like that. Like crime scene stuff. - Ooh. Damn, that's kind of, like, very, you know? - He doesn't know the word. - What's that word? I'm trying to think of it. [Sidemen laughing] Okay, so what blood type do I have? [Sidemen laughing] - I'm dead! I'm dead! - I'm gonna guess, like, O. - I'm dead! This guy! What is he? - No. - What blood type? [Sidemen laughing] - I'm dead! - I said no! [Sidemen laughing] - Hey. - Kiyota. - Kiyota? That's an anime name. - It means hello. So I'm from New Zealand. My name is Julia Root. I brought you something. - What? - So I know you were sick recently, so I got you something from New Zealand. - That's quite cute. - We're known for having a lot of sheep, kind of being sheep f*ckers, but anyway, that's a whole nother thing. - She's shaped like a question mark. - So I got you a little lamb so that you feel better. - Oh, thank you. - You're welcome. - Thank you. That actually hit me to the heart. Like you've remembered that I had a very bad headache. - Yeah. Yeah. - Can I get a 360? - Okay. [Sidemen laughing] - What? Yeah. Yeah. Okay. That's good. - You said something when I turned around? I heard something. [Sidemen laughing] - That's crazy. You actually look, you know, good. - Thank you. - Yes, yes, yes. Yeah, yeah, yeah. Hold onto it. - Okay. - Hi. - Hey. - I'm Taryn. - Bro asks where they're from like four times, by the way. - Okay, where are you from? - Guyana and Montserrat. Guyana. - Oh, Gayner. Gayner. - Gayner. Oh, my God. - In South America. - Yeah. I know that. - Do you know that? - No. [Sidemen laughing] What do you do? - I'm a probation officer. - Oh, wow. - You the feds? [Sidemen laughing] - We more rehabilitate. So we help people after they come out of prison. - I just came out of prison. I just killed somebody. - Then I can help you. - I need my tummy rubbed. - I need my tummy rubbed. - Can I comfort you? - Yeah, comfort me. - This guy, man. [Sidemen laughing] - It's okay. - Keep having these problems, you know? - If you have any concerns, let me know. We can refer you to the right agencies. - Yes, mummy. - mummy? - What's happening? - I mean, yes, darling. Thank you so much, you know. Damn. Okay. Yes, yes, yes. Yes, yes, yes. Where you from? - Namibia. - Where? - Namibia. - Where? - Namibia. Southwest Africa. - Namibia. Yeah. - It's okay. - I think it's the way\nyou're pronouncing it, but fair enough. [Sidemen laughing] I don't know what to say. - He's run out of lines. - I don't know. You ask me a question. Let's switch it. - He actually has run out of lines. - Yeah. Just say yes or no, bro. - Brudda, go help him out, please. - Is it your first time in London? - Mm-hmm. - How's it going? - Good. - You came at the right time. - Thank you. No. - Ah. - Oh, he's done it. - Okay. Calm. - Oh, God. Don't suck my blood, God damnit. - Hello. - Hello. - Hi. - Hey. - Hey. - Hey. - I said hey, not you. - Oh, my God, he's just waved at her tits. - Oh, damn. [Sidemen laughing] - My fault. - I knew you'd go straight for the tits, not gonna lie. - Yeah, I knew it. - To be fair, they're pushed up quite big, so. - sh*t. - Yeah, my name's Lowri. [Sidemen laughing] - Okay. Hey. Damn, I can't even focus. sh*t. How old are you? - I'm 24. - 24. Where are you from? - I'm from Wales so I'm Welsh. - You speak the Welshian? - Welshian. - Yeah. I'm actually first language Welsh. Want me to teach you something? - Yeah, say something. [Lowri speaking Welsh] - It actually does not make sense. - That means, \"I really fancy you.\" - It's like when you got something stuck in your throat and you go, [clearing throat]. [Sidemen laughing] - I say yes. I say yes. - He said no to, like, three people. [Sidemen laughing] - How you doing? - The next girl has just seen that. - Nice to meet you, ma'am. - Sarah. - Where you from? - London. - From London. You're from South London, aren't you? - How'd you know I'm from South? [Sidemen laughing] - \"How'd you know I'm from South?\" - I can sense the badness, that bad apple in South London. You know what I'm saying? - Really? Is that a good thing or a bad thing? - It's a good thing. It's a good thing. 'Cause I like the bad apple [indistinct], you know what I'm saying? - Oh, really? South London is where it's at, though. Tell you that for free. - I don't know about that. - No, that's not true. - X to doubt. - South ain't nothing\nbut bricks and trash. - I'm offended. - So what's North got? - Chelsiah. - Chelsiah?", "896.516 - 1195.7440000000001": "- Yes, yes, yes. - How's he said yes out of that? - Yeah. - How fast do I have to f*cking go? God damn. - What just happened? - So you just look at their faces and be like, \"No.\" No! [Sidemen laughing] - Let me introduce myself first. - No! - Uh-uh. - Oh, really? Oh, yeah. Okay. Introduce yourself. - Hi, I am Kelsey. I am 25 and dancer and model. - All right. I'm hot. Can you fan me? - Fan you? - Yeah, I'm hot. - Yeah. I can fan you. All the way around? - Yeah, all the way around. All the way around. - He's falling in love all the time. - Like this? - Oh, okay. Yeah, yeah. - Whoa, whoa, whoa! - Yeah, just like that. - Virgin eyes. [Speed barking] - I was waiting until\nyou were gonna do that. - No. - He said no! - Well, nice to meet you. - Man got her to fan him and he said no! Is he done? Yeah, bring him up. - Brudda, what the f*ck? - Bro is dripping. - Bro, I'm sweating out here, bro. So what's next now? - You gotta see if they say yes to you. - They ain't gonna say no to me. - I don't think any will. - Do you have any favourites? - Her ass is fat. I can tell you don't\nlike one girl up there. You're like, \"No, no.\" [Speed mumbling] [Sidemen laughing] - What you said. - 3, 2, 1. - Oh. - Called it. Called it. That's my GOAT. [Sidemen applauding] That's my GOAT. [upbeat music] - Damn. - What did I say? - Bro is doing the celebration. [Sidemen laughing] - I told you. - Let's go. - Jeez. - Is there anyone there that you really, really like? - Yeah, do you want a free date? - I'm kind of liking the Indian girl. - That was the first one, right? - Yeah, she's pretty. - You remember all of them. [crosstalk] - Tobi's always scouting\ngirls anywhere you go. - You've been nowhere with me. What the f*ck? - I should have watched a 20 V 1 video. I knew it. - Ready for Speed. - Bro nearly touched my piece getting up. - With this one, we just want you to just be yourself. - Be myself? - We wanna rate your rizz. - f*ck. - Drop Tobi game. - No. [Sidemen laughing] - Wait, wait. - What does that mean? - He always tries too hard. - He knows you, bro. - So what do I, like-? - Have you ever been on a date? - No, I'm being honest. - Oh, wow. Okay. - This is your first date. - Enjoy your first time. - Good luck. - Tobi, f*ck outta here. [Sidemen laughing] - Put it closer to your mouth. In your mouth. - KSI's moaning in the mic. [Sidemen laughing] - He got gassed. - He got excited about that. - Why's bro not sitting down? - Brudda, sit down. - Right or left? - Yeah, that one. That one, that one. Actually move seat real quick. Nah, I don't like that one. Move to the other seat. - Yo, KSI, f*ck you, bro. [Sidemen laughing] He's f*cking with me. He's trolling. - Hi babe, you okay? - Hey, hey. Hey, actually this is like my first date. - Really? - Yeah, I'm kind of excited. You know? - You've never been on a date before? - I've never been on a date before. - That's crazy. - I don't really know what to do. But I generally like you, you know, you a very pretty lady. - He's smooth with it. - Jeez. - What's your favourite dish from India? - Lamb Rogan Josh. - Come on, my guy. My G, come on. - You gotta put the curry on it and the sauce on it? - Mm. - I love it. - Curry on it and the sauce on it? [Sidemen laughing] - And you say you're, what, 23? Hold on, wait. Time out. [Sidemen laughing] Forehead's laughing. [Sidemen laughing] I don't wanna say it right now. - Just tell him we'll mute it. - All right, there we go, okay. My fault, my fault. I was having some weird things going on with my body. - Forehead's laughing. - d*ckhead. - You're very beautiful. - You're very handsome. - Actually? - Very, yeah. - What is handsome about me? - You have really kind eyes and you have really nice lips, as well. - No one never said\nthat to me before, lady. Nobody never said that to me. - Oh, here we go. - Nobody. - Oh. - Ooh. - Thank you. - Stop, I'm gonna fall in love. - I feel a bit sick. - Because I'm actually already falling love with you. - He says Tobi tries too hard. [Sidemen laughing] - Maybe I'm falling in\nlove with you, as well. - You're lying to me. She's lying. I can tell when somebody's lying. - Look into my eyes. Am I lying? [Speed barking] [Sidemen laughing] - Wait. Do that again. [Yakshinee barking] [Sidemen laughing] Like you mean it, baby. - It sounded like a \"COD\" zombie. [Speed barking] - In your heart. [Yakshinee barking] She's the one. Oh, my God. God, finally. - Poor girl. [Sidemen laughing] - You're the one I've been\nlooking for, you know. - I've been looking for you. - I like you so much, yeah. - Oh, bless you. - Like I don't even know\nwhat to say anymore. - Bro, your rizz stinks. Ask for her number. - Yo, can I get your number?", "1195.7440000000001 - 1495.478": "Can I get your number? - I don't have my number on me, but. - \"I don't have my number on me.\" - \"I left my number at home.\" [Sidemen laughing] - So look, I got a Premier\nLeague game tomorrow, you know what I'm saying? - Yeah. - About to score a hat-trick. If I wanna, you know, take you out after the match, would you be up for that? - Definitely, yeah, I'd love that, yeah. [Sidemen applauding] - He barked in her face and still secured. - Bye. - Bye. [upbeat music] - Do you reckon that's his first number he's got, as well? - Probably. - Let's go, bro. - Rizz. - That's too easy for me, bro. - Oh, it's gonna get much worse. - It will get worse. - How do you think the date went? - It went really well, surprisingly. But, yeah, he's really good looking and I'm surprised he asked for my number, as well. So, that's a win. - Do you reckon you'll follow it up with a second date? - Definitely, yeah. - She said yes to a second date, bro. - Can you rate the date out of 10? - 10. [Sidemen laughing] - Nah. She's smoking on something, bro. Ain't no way. - All right, Speed, for this next one, you are gonna be the most disgusting version of yourself. Terrible hygiene. I'm talking biting your fingernails, picking your nose, picking your ears. - Scratching your butt. - Scratching your ass. - Y'all serious? - Scratching your balls. Like, \"Damn, I think I got crabs.\" - Ooh! - God, that stinks. You wanna smell? - Hey, not now! [Sidemen screaming] - You've been wearing those two weeks. - Two days. Two days. - For her, you tell her two weeks. - Is this what they do to everybody? - Yeah. - He has actually never\nwatched one, by the way. - Watch, I'll still pull her, though. - Oh, okay. - He has never seen this before. - Never. - Never. - Hello. - Hey. Nice to meet you. - Nice to meet you. No, gosh, let's not do that. Let's not do that. - Let's not do what? - Gimme your other hand instead. - Okay. [Sidemen laughing] - That was a bit grim. - Bit grim? What does that mean? - Like, disgusting. - How? I just wanted to show- No, I wanted to show you my underwear. No, I have CR7 underwear. - Oh, have you got CR7? - Yeah. CR7 underwear. Wait, you think Ronaldo's nasty? - No one said that, Speed. - Tell her that Ronaldo touched those, you're never taking them off. - So these drawers right here, I've been having these on for the past four months. [Sidemen laughing] I met Ronaldo, and ever since then I never took these drawers off. - Just say, \"I f*cking stink, bro.\" - And you touched my hands? - I f*cking stink. [Sidemen laughing] - That's grim. - Why? - Because you need to wash your boxers. - But Ronaldo touched them. - Okay, fair. That's fair, then. - What? - Oh. - Do I stink? You're scared? - I'm scared. - You're scared to smell me. - No, don't say that. - So why won't you smell me, then? - Because you just said you'd be wearing boxers for like four months. - That's actually crazy. - I got a little sh*t\nstain here and there. - Well, sometimes I do be having, like, sh*t stains and sh*t. Like, cum and all that on my drawers. - That is grim. - \"Grim.\" [Sidemen laughing] Like what are you saying? - Put a finger up your nose. - Do you wanna teach me your lingo? - Yeah, teach me some lingo. - No, you teach me. Oh, why you doing that? - What are you talking about? - Say, \"In my culture this is normal.\" - Whoa, Vik. - Like, bro, I'm deadass. Like, in Portugal, this is normal. - Is it? - Yeah. - What you mean by that? - It's kind of f*cked up how you just bashing me 'cause I'm just doing regular things that I do in my country, bro. You laughing about how my drawers look, you know, sh*t stains and all that. Like, bro, I know I stink but I still love and like you, you know. It's crazy. - That is so bad. - Say your boogers taste good. - If you really like someone, you wouldn't just- Ugh, don't put it in your mouth! - Boogers kind of taste good. - It's got a little bit of salt. - Tastes like a little salt. - That is disgusting. - Really? - Yeah. - You're, like, being deadass right now? - Yeah. - I don't rate that. - I want you to try and pick your nose. - All right. How about you pick your nose? Since you're like talking about- - No, no, no. - No, no, no, no. It's my culture and you said you respect my culture. How about you pick your nose now? - No, thank you. - This is so disrespectful right now. - This is so f*cking disre-f*cking-spectful! [Sidemen laughing] - No, don't cry. - That sh*t crazy, bruh! - Why are you crying? - I need you to pick your nose. - I need you to pick your nose. Like, I'm deadass. - Do it with me. - Please, with me, I'll do it with you. Please. - No. - I'll do it with you. Come on. - I'll do it for you. - Do you want me to do it for you? - You want me to do it for you? - No! [Sidemen laughing] Don't do that. - Smell your feet. - You scared me off now. - That sh*t crazy, bro. What was you saying? - Pink socks. - Pink socks, bro. - First of all, why have you got pink socks on? - Yeah. Respect. - Breast cancer. October.", "1495.478 - 1795.565": "[Sidemen laughing] - That's a nice thought, though, isn't it? - Huh? - Is there anything else that you wanna do before, like? - I wanna scratch my\nass actually real quick. - I feel like scratching my ass. - Go on, go on. Do it. Go on. Let's see. - Start moaning while doing it. - Honestly- No, face me and do it, as well. [Sidemen laughing] - Oh, yeah. [Sidemen laughing] - Good luck to the next girl that's gonna shake your hand. - You wanna smell? - Wanna smell it? Nah, I'm serious, it smells good. It smells good. I'm serious. - No, thank you, no. - Smells like coconut oil. - Ask for the number. - No, no, thank you. - All right, bro, okay. Can I get your number, though, please? - All right. It's 0-7. - Come on! - You do it, you do it. - Ain't no way, man! What is this? - Bro literally said, \"I've got sh*tty arsehole right now.\" - Okay, so, look. And I got your number. Next time respect my culture. - This is ridiculous. - He's got sh*tty pants on and still pulled her. - Because I really do like you. I love you, Bengalian. You know what I'm saying? - Bengalian. - He's still picking his nose. - Do us a favour. Next girl you see, shake her hand. - Okay, I will. - That's toxic. - That's mad. - I respect it. - She vote next girl got arsy hand. - You can leave now, bro. - Oh, no, what are they telling you to do? What are they telling you to do? If you're gonna fart- f*ck off. - There's no way. - f*ck off. f*ck off. f*ck off. [Sidemen laughing] f*ck right off. - We didn't tell him to do this. - Why are you farting? Why you trying to pressure a fart? - f*ck. - He's gonna sh*t himself. - I feel like a sh*t turd is coming out. [Sidemen laughing] - No one has even told him to do that. - I told him to leave. - That is actually grim. Is he actually always like this? - She said f*ck off. [Sidemen laughing] - f*ck off. - We're gonna ask you in a mument how your date went. - Did you see how that went? [Sidemen applauding] - That's a sh*tty hand right there. - f*ck it. [Sidemen laughing] - Yeah, yeah. - We're piss and sh*t boys. - So, how was your date? - Did you see that? That was awful, wasn't it? He literally, like, touched his bum, tried to shake my hand. I told him to touch the next girl, though. So good luck to her. [Sidemen laughing] - Would you give Speed another chance at a date? - No. - Did you give him the wrong number, by the way? - I can't lie, that was my actual number. - Regret. - And I rang it, as well. - These women nowadays! - Y'all can't stop me. You can't stop me. Whatever y'all do. Smelly ass, smelly balls. Go worse, then. Come on. I need a challenge. Come on. I literally scratched my balls, scratched my ass and I still got her. Come on now, bro. - All right, the next date, we're gonna give you a guitar and you have to serenade\nher with a freestyle. - Have to what? - Serenade her. - What does that mean? - Sing to her. - While playing guitar. - While playing the guitar. - Why can't Miniminter just say sing? [Sidemen laughing] \"Serenade her.\" - And everything- [Sidemen laughing] Everything has to just be, like, singing in it. So you can't just be speaking to her. It has to be you singing. - Hiya. - You ever used a guitar before? [Speed singing] [Sidemen laughing] - Here we go. - Aww. [guitar ringing] - Oh, God. - Hey, trouble. - Trouble? [guitar ringing] - Aww. - She's getting into it way too much for the notes he's playing. - Wow. - Hey. Sunshine. You're so beautiful. - The modern day Ed Sheeran. - Oh, my. I love the pink. I love you. - Oh, wow. - It's so beautiful. Oh, you. - We ain't making it out the hood. [Sidemen laughing] - Are you gonna carry on or are we done? - Yes. - Oh, wow. You were so close to cutting me, weren't you? Can you explain that in a song? - What do you mean? [Sidemen laughing] - Bro played a riff. - Nearly cut me 'cause of my sh*t dance moves. - Oh, yes. The sh*t dance moves. I almost forgot. They were so sh*t. So show me something now that makes sense. - Oh. - Okay. - I'll only show you good dance moves if you could sing in tune. - Ooh. [guitar ringing] - Come on. - This is my last two brain cells.", "1795.565 - 2096.3720000000003": "- Should you do that little tshh where you get rid of it? - Why not? Who's stopping me? - Not again. [Sidemen laughing] - Brudda, don't you dare. That is my guitar. - That's a bit disappointing. - Look at his face. - Okay, look, I know you're a bit upset about this. - Make her play the guitar. - Guitar. - Okay. [Sidemen laughing] - You sing, I play. - Okay. [guitar ringing] - This is mental. - Down your spine you feel a tingle when you hear this Christmas jingle. This one's drill not pop like Pringle. You can get crossed up, no Kris Kringle. See, it's Christmas and you don't want to miss this. - Grab the guitar and smash it. - Shut the f*ck up. [Sidemen laughing] - He didn't do it. - Tell him to leave when he's smashed it. [Sidemen laughing] - And just walk out. Walk out. - Now that is a performance. - Shut the f*ck up. [Sidemen laughing] - Oh, my God. - And that's what I like to see. [Sidemen applauding] - Watch this. - To be fair, I really appreciate the fact that he's just gone for it. Like, he, you know, I knew I was more the dominant one out of the two. - She liked the guitar smash. - Beta Speed. - So I knew if I did something like that for him to impress me, he did it, didn't he in the end? - How do you think your date went? - At least I got her number. - I think it was random. I quite liked it. I'm quite a spontaneous girl. - What the f*ck? - And you know what? He smashed a guitar for me, you know, so who's really winning? Could be beautiful. - Three for three. - So I'm happy. - Would you go on another date with Speed? - Yeah, but I think he needs to have some singing lessons. - Her f*cking dancing. [Sidemen laughing] [Sidemen yelling] - Let it go. [Sidemen laughing] - That's not fair. - I'm in real danger of getting my balls grabbed as you get up. This homie was here. - My fault. [Sidemen laughing] - It's thickums. - Keep her still. - She could barely walk. - Keep her still. - Keep her still. What's all that movement back there? - Speed, this one, I want to see your Portuginese. [Sidemen laughing] - Da. - That's yes in Russian, no? - Yeah. - Net. - No English. Just Portuguese. - Claro, claro, claro. - He understands. - Nice, nice. - Cheers, Josh. - So I just speak Portuginese to her. [Sidemen laughing] - Ola. - Hey. [Speed speaking Portuguese] Oh, you speak Portuguese. [Speed speaking Portuguese] Nice to see you again. [Speed speaking Portuguese] - Do you know what he's saying? - Bro, he's making up words. [Speed speaking made up language] - Mm. [Speed speaking made up language] Yeah, I get it. Yeah, yeah. [Speed speaking made up language] Yeah? [Speed speaking made up language] You. Me. - I think he said he'd like her number. [Speed speaking made up language] - Yeah, I want your phone number. [Speed speaking made up language] - You. Me. You. [Speed speaking made up language] You like me. - No! [Sidemen laughing] - You want. [Speed speaking made up language] - You should go down now and just change the meaning of that. - Yeah, yeah. - Phone. [Speed speaking made up language] Take a picture? You want the number? [Speed speaking made up language] - Bro got that with Portuguese. - Bro, he still got it. [Speed speaking made up language] - Clap your hands. - You want to-? [Speed speaking made up language] [Speed clapping] Oh, my gosh, you are so naughty. [Speed speaking made up language] - No, not now. - Sorry. Sorry about him. I'll be his translator. - Okay. Thank you. - Go. [Speed speaking made up language] - Your friend. Yeah. [Speed speaking made up language] He's Angolan! - Yeah. [Speed speaking made up language] - Okay. Speed says you have a massive arse. - Okay. [Speed speaking made up language] - Okay, he's wondering how is my small penis going to enter that massive arse. [Speed speaking made up language] - Give him an Oscar. - How do you walk with that arse? [Sidemen laughing] - I, like, walk with my legs. [Speed speaking made up language]", "2096.3720000000003 - 2395.082": "Can I please see your arse? - Si. - That's what he wants. Yeah. - You can look, but you can't touch. - Okay. [KSI speaking made up language] [Speed speaking made up language] - You go now? [Speed speaking made up language] - Bunda, bunda, bunda, bunda. [Speed speaking made up language] - Okay. He wants you to walk up and down. [Ethan laughing] - Okay. Yeah. So. [Speed speaking made up language] - Oh, my God. Jesus Christ, that's insane. [Speed speaking made up language] Oh, my God. God has blessed you. [Speed speaking made up language] You are the greatest thing I've ever seen. [Speed speaking made up language] It's so big. Oh, my God. [Speed speaking made up language] You are making me horny. [Speed speaking made up language] Yes, this is fantastic. [Speed speaking made up language] - Who's Vicky? - I don't actually know\nwhat he means by that, but I think he wants your number. - Yeah. Yeah. I've given you numero. [Speed speaking made up language] - No, he wants your mum's number. Sorry. [Speed speaking made up language] - Call now? - He wants you to call your mum. - No. [Speed speaking made up language] - He wants you to call your dad. - My dad? [Speed speaking made up language] I don't even know my dad. [Speed screaming] I do know my dad, but like, I just don't speak to my dad. - Complicated. Complicated. - Padre. - Padre complicated. - Drag JJ out. - Okay, bye-bye. Ciao-ciao. - Go with him. Go with him. - Okay. I'm leaving. [Speed speaking made up language] I mean, that's not my fault. [Sidemen applauding] - That's the best one. - Watch how I still pull her. Yo, KSI's actually a dumbass. [Sidemen laughing] - So how do you think your date went? - Bunda, bunda, bunda. - There was a language barrier. [Sidemen laughing] But I think it went kind of well. - What? - I think he complimented me loads. And I appreciate that. It might be a little bit too forward for like the first date, but we can work on that. - Four for four. - And would you go on a second date? - Yeah. - Got a lot of girls' numbers, bro. - But I don't even think he spoke a little bit of English. So maybe if he brings his translator. - Are you quite interested in the translator, as well, are you? - No, no, no. But like, I think his translator helped the process, you know. - Everywhere you go, bro, I'm there. - You are making me horny. - Thank you. - Thank you. - I feel like when you\nget your phone back, all of a sudden you remembered English. - \"Kai has a fat penis.\" - Oh, you seen that? - A fat black penis. - You sound surprised about that bit. - It's black? - It's black? - She's the back flip one. - She came in and did a cartwheel. - Yeah. - Right, Speed, she came in doing a cartwheel but you are more acrobatic. You need to challenge her to everything. Pushups, running, anything you can, and you need to beat her. Back flips. And you need to beat her and you need to tell her that you are better and\ncelebrate like crazy. - I'm just a asshole and jackass. Like, I'm better than her. - Yeah. - Okay. - Make it physical. - Brother, please. [Sidemen laughing] It's four times now. Not the fifth. - Hello. - How are you? - Bro still hasn't washed\nthat hand, by the way. - Nice to meet you. Gimme a hug, matter of fact, gimme a hug. How you been? Did you miss me? - I missed you, yeah. You took your time. - By now, if I'm not mistaken, you're good at flipping, right? - I'm a gymnast and a gymnastics teacher, yes. - So you're telling me, whatever I do, you can do better? - Yeah. - Do this better than me, okay? - Okay. - That's actually really impressive. - There's no way. - What? - What the f*ck? - Oh, my God, that was ridiculous. - I did it better. - I'm actually terrified. - He's in shock. - Damn. Hold on. - That was sick. - Damn, that was my one only- All right. Can you do this? - That's pretty sick, to be fair. - Do you want exactly that? - Yeah, just exactly that. Just don't twist it. - f*ck, man. - Yeah, she was going somewhere else, as well, after. - Damn. - Can you do the splits? - Yeah, I can do the splits. - Can he? - Bro is gonna injure\nhimself before the game. Oh, God. - Whoo! That's good. - Yeah, lemme see you do yours. - Are you sure? - Yeah. - I don't wanna make you look bad. - No, just do it. - Jesus Christ. - That's crazy, bro. That's just insane.", "2395.082 - 2696.838": "That's just insane, bro. sh*t. - I know what he was doing there. I know what he was doing. - So you know how to do cartwheels, back flips, front flips. - What can we get him to do? - Can you do this? [Sidemen laughing] - There you go. [Sidemen laughing] - It's good views. It's good views. - I respect her a lot, you know. - Mines was better, but, okay. - Oh, my God. - Let's do this. - Oh. - I know you can't do this. - Oh. - I know you can't do this. - He's on the infinity wall. - Go on, then. - Why is he doing long jump in the studio? - Really? Really? - What was he about to do? - I dunno. I just wanted to stitch you up. - She's about it. - That could have been really bad. - What the f*ck? - No, no, no, no, no. Let me do it. See, you're scared. You know that you can't do this. - Okay. - You know you can't do\nwhat I'm about to do. Yeah. Stand back here. - That was pretty sick, actually. - I can do something better. - Do that. You need help? You need help? [Sidemen laughing] - What was she trying to do there? - Yeah. - You sure? You sure? - That was it. - She looked like someone got run over or something. - Do it again. - Do it again? - Hang on, hang on, hang on. If you're so good. - That's brave. - She's trying to kill him. - Jump over that? - Yeah. - When do we stop this madness? - I need help, guys. I need help. I need help. Let's talk about something else. - He's a smart man. - Hey, I got a charity match. I don't even wanna try. - Say, \"You win, mummy.\" - mummy, you win. - Yeah! - You're a mummy. - I'm your b*tch. - I'm your b*tch. - Do you want me to bark for you? - Want me to bark? - Go on. Let's hear it. And I'll do it better. - Oh, oh, oh. [Speed barking] [Karina barking] - I think he's found his match. - Will you marry me? - Would you marry me? - Get down on one knee. - She is like dominatrix sh*t. - Take it off so I can marry you. Would you marry me? - Okay. - I'll drink your milk. - Eyo, chill. - I'll drink your milk. - That was mad. - Get that mic out of his hands. - I'd drink your period. [Sidemen screaming] - Thank you. - So now we're husband and wife. - Yeah. - I love you, mummy. I'll see you soon. - Does that mean a second date? - I love you, mummy. See you soon. - Bye, baby. - Wait, lemme get your- - He's actually getting the number. - Lemme get your number. [Sidemen laughing] - Wait. So did he say I want to-? - Drink your period? Yeah. - I went to the toilet and heard barking and then that happened. - They barked at each other. - Bye, baby. - Bye. - She was too good. - How do you think your date went? - I think it went well. Well, I guess he was a little bit embarrassed at certain times. And that's okay. Men can show their true feelings. They don't always have to\nbe as big as they seem. - And would you give Speed a second date? - Well, we're married now, so I guess I'm gonna have to. - Engaged. What the f*ck? - Cool. Thank you very much. - She tried to kill you, by the way, when she kicked out that chair. - I'm going to tell you to be a different animal while you are on your date. You have to act out, as well. - Yeah. Like cat, dog, snake. - Shark out of water. - Shark. - Shark out of water. - Is he talking during the date? - He's talking, yeah, you talking normally and then I'll tell you an animal. - But when you're an animal you can't talk English. - All right, fair enough. Let's go. - Wait, someone gimme a list of animals. - No, no, don't worry. I got you. I got you. - Bro, you're literally a 30 year old man. - Yeah, yeah. - You know animals. - Yo, how you doing, beautiful? - I'm good. How are you? - Doing fine, of course. How you been? - I've been good. - He's cooking. He's cooking. - I've been waiting to see you. You know, you're beautiful. - Dog. - Aw, thank you. [Speed barking] - That's traumatic. - Human. - Now, for real, I haven't seen you in a very long time. - She's traumatised. - Is that normal to you? - What do you mean? - Is that what you do? - Cat. - Oh, hell no. Oh, hell no. [Speed meowing] Uh-uh. - Start purring. [Speed meowing] [Sidemen laughing] Human. - So what was you saying? - No, I was saying like, you from South London and sh*t. I was trying to tell you, like, bro, that's the hood and sh*t. And I was saying Manchester, and I still stand by that, Manchester is better than London. - Elephant. [Speed roaring] - Nah, I'm done. - What the f*ck? - This is too much. [Speed roaring] - Snake. - Is this normal to you?", "2696.838 - 2996.047": "Help! Oh, hell no. - Human. - What, bro? So, like, I deadass think Manchester is better than London, bro. And Chelsea is in the East London, West London or whatever. - Shark out of water. - That's in South London. No. No. [Sidemen laughing] - What the f*ck is he doing? - Human. - I just don't get it. Like, I'm sitting here trying to talk to a beautiful woman. - Do something more like\nWoodlouse or something. - I deadass think you're the one. - Cockroach, cockroach. - Stand up. - Cockroach. [Sidemen laughing] - That's his best impression yet. - What are you looking for? - Bee. [Speed buzzing] - That is terrifying. Make him a human. - Komodo dragon. [Sidemen laughing] - Make him a human, please. - I don't know. Do I bark back? - Dinosaur. - Do I not? - Dinosaur! [Speed roaring] - No way. [Speed roaring] This is not what I signed up for. - The fingers, it's gold. - You're human. - She's mortified. - Can you stand up for me, please? - Ask her what's wrong. - Like, what's wrong with you? You look so uncomfortable and sh*t. - I mean, I am uncomfortable. - Look. You feel me? Like turn around, you\nknow what I'm saying? - Okay. I try, I try. Well, can you stop doing\nthis weird stuff now? - Doing what? - What you've been doing. - What am I doing? - No, you're doing a lot. - You're doing a lot. - You're not doing enough. - You're not doing enough. - Oh, sh*t. [Sidemen laughing] - Come on. You're not doing enough. - Oh, sh*t. - So you want me to bark, meow? - Gimme a high five. - Gimme a high five. - Dinosaur. [Speed roaring] - This is a lot. [Speed roaring] - That's his best impression. - Yeah. The fingers, bro. - Lion. [Speed roaring] - That's actually what lions sound like. - They do. - True. - Fox. - I don't know what I expected. [Speed bleating] How was your flight? - How was your flight? - Human. - What'd you say? - Where you coming from? - I'm from Ohio, but my ethnicity is Portugal. From Ohio, though. - Makes a lot of sense. - Ask her her favourite animal. - What's your favourite animal? - Dolphin. - Do it. Do it. - The noise. [Speed bleating] - That was so cold. - Okay. Human. - So meaningful. - Ask her if this turns her on. - Ooh, Vik rizz. - Does it turn around? [Sidemen laughing] - What'd you say? - Does it turn around? - A dolphin? - Does it turn around? - Does what turn around? - Just say, if you know, you know. - If you know, you know. [Sidemen laughing] I ain't gonna say too much. - Penguin. He's griddying. - Are you possessed? [Sidemen laughing] Oh, no. He's a lot. - Human. - Calm down. All right, just calm down. - I'm calm. - Like, what's up with you? - What's up with you? - Pikachu. - Pika! - This kid is not right in the head. - Relax, you know? - All right, try and get the number. - If he gets this number, it's crazy. - All right, bro. You know what? Okay, can I get your number? - Are you gonna keep doing that? - Do what? - Do what, bro? - I'm just making sure this is- - Bro, I'm not doing anything. Just lemme get your number. - All right. - Dinosaur. [Speed roaring] - I was just waiting for- - Human. - Bro, let me get your number. - Look at what you're doing. - Let me get your number. - Look what you're doing. - Just let me get your number. I'm not doing anything. Lemme get your number. - Are you dumb with something? - No. - Are you f*cking stupid? Like what the f*ck? This girl's a wanker. - You're a f*cking wanker. - Damn, shawty. - Oh, she's fighting him. - He's still getting the number. - Yeah, I do wank. And what? - Yeah, I wank and what? - I'm even still typing my number like a wasteman. [Sidemen laughing] I can't do this. - Bro, she's a bloke, bro. Just let me give it. Bro, you didn't even\nput your full number in. - Because look how you're acting. - What are you talking about? - I couldn't get to the last number, look how you're acting. - Bro, just do it, bro. Stop being a wanker\nand just f*cking do it. - Stop being a wanker and just do it.", "2996.047 - 3296.4359999999997": "[Sidemen laughing] - Dinosaur. [Speed roaring] - You tell me I'm supposed\nto give you my number when you're acting like a damn fool. - Leave as a cockroach. - She's so pissed. - Just lemme get your number. Just finish it. - If he gets this number, it's crazy. - Call it. - Call it. - Now I have your number. [Sidemen laughing] - The lick! She is mortified. - That's terrifying. - That was amazing. - Why did you make me do it? - So how do you think your date went? - I'm a bit confused. Distraught. - Distraught. - She was bad, bro. - It went. It went. - It went. - That's all I have to say. It went. - It went. - Would you have a second date with Speed? - Oh, absolutely not. - No second date. - I don't think we could even get past\na normal conversation. - It's your first miss. - We got him. - Yes! - Did you give him your real number? - Wait, wait. - Yeah, I did, but he can't call it anyways. - Why? - Why can't he call it? - No, 'cause UK number. - I have AT&T, dumbass. [Sidemen laughing] - Just call it and dinosaur. [Sidemen laughing] - She's traumatised. - That was very good. [Sidemen applauding] [mellow music] - We decided to change you into... - Football boots. - Something a bit more suited. Some socks, some shin pads, some shorts. And, of course. - It's a lovely kit. - So now you f*cking with my pride. [Sidemen laughing] - The animals weren't? - Messi, bro? Bro, I don't like him, though, bro. It don't feel right. It's like sticking something up your butt. [Sidemen laughing] It doesn't feel right. - For some. - Yeah, yeah. Some people like that. - You excluding yourself, Bez? [Sidemen laughing] - Why you looking at me like that? - I know you like it. - If you really don't wanna wear it you can just wear the Portugal one. - I'm wearing the Portugal. f*ck that Messi shirt, man. So I put this on and what? - Convince her that you're a professional footballer. - This must a Miniminter idea, isn't it? [Sidemen laughing] - Hi. - There we go. He's in. - How you doing? - Oh! She's dispossessed him. She's a baller. - Slide tackle her. Two-foot her. - You didn't say hi. - Yeah, but I was gonna show you hi by a different way. - Oh, you were? [Sidemen laughing] - Basically, I'm a professional Premier League player. I go as Rafael Leao, you know. - Rafael Leo? - Yep. - That was arse. - I have terrible- Okay. Hand-eye. - I'm gonna show you some of my skills. - Lemme show you my touch real quick. - Okay. - Gimme the ball high up. Just like that. - Okay. Okay. Oh, that's pretty good. - It was arse. - What was that? - Where'd you get that fit from? - Just online. [Sidemen laughing] - He's got three kick ups in a max. - Oh, oh, oh. - Is it safe with your shoelaces untied? - Yeah. Lemme see the goals. - They've brought goals. - He's gonna break her ankle. - Take your boots off. I wanna show you some skills. - You feel better now? - I wanna show you some\nGod damn skills, okay? - Okay. Show me your skills. - This is what I call the elastico. - Now this is what I call the f*cking elastico here, you get what I mean? - Okay. You gotta impress me. - Ooh. [Sidemen laughing] - Flip flap with a slap. - I like that one. That was like a 8.5. - This is a rainbow flick. - Now this is a rainbow flick. - Okay, I'm ready. - You ready? - Don't hit me. Ooh! - Make one up. - All right, now this is the superstar 5,000. - All right, this is the superstar 5,000. - Superstar 5,000. - See what he does. - Oh, my gosh! [Sidemen laughing] - Relax. What are you doing? - Why is it coming this way? - These are the dustiest shin pads that I've ever seen, by the way. - No, no, no. You're gonna hit me in the face. - They got that ankle thing on it from the f*cking 2000s. - Relax. - Oh. - Relax. - That's horrible. [Sidemen laughing] - What's going on? - I was entertained. It was really good. - She's trying to yam his batty. - Every time I'm trying to do a move, you was like- - Sorry, I was trying to just catch you. - Let's play a game. - Okay, let's play a game now. - What are we playing? - 1v1 for your number.", "3296.4359999999997 - 3596.466": "- Okay. - This is my goal. This is your goal, okay. - Okay. - Are you ready? [upbeat music] - Oh, oh. Oh, no. - She might wanna take her shoes off. - You wanna take your shoes off or you gonna keep the heels on? - I can do it in these. - Oh, my God! - Nah, nah, nah. No, no, no, no, no, no, no, no. - Oh, my God. You suck. - Offside, offside. She's offside. - What would you name that out of 10? - You were offside. - Come again. - No, it's offside. - One-nil. Okay, let's go again. That's fine. One-nil. - Nil-nil. - And I did in my heels. - She's just booting him. - It's okay. It's good practise. - Oh! - What's happening? - Let him cook. - He's cooking. - Next goal wins. - Next goal wins. - Next goal wins. - I hope she wins, man. - You ready? This is the end for you. - Just pick up the goal if she tries to shoot. [Sidemen laughing] - That's even better. - You can't just pick it up. [Sidemen laughing] - Throw in. - Can you do, like, what is it where they\ndo it with the chest? - Yes. - I'm gonna throw it\nat you and you're like. - Yeah, yeah. - You gonna do it? Ready? - She is setting him up. - Okay. Ready? Do it. Yeah. - Do you wanna control\nit with your breasts? - Eyo. - You wanna control it with your tits? [Sidemen laughing] - Yeah. - Okay. - Go. Which one are you aiming for? - Just whatever. - Okay. Go. - What? - Sorry. Go. Was that good? Can I be the ball? - Yeah. - So I'm the ball? - Yeah. - Do it again but then sniff the ball. - All right. All right. [Sidemen laughing] - Did you like that? - Yeah, I do like that. - Now score when she's not looking. - Yeah, did it smell good? [Sidemen laughing] - Oh, you're a cheat. You're a cheat! - Do the Bellingham. - Sew on her. - Sew! - Oh, sh*t, she into it. - Hey, look, I get your number now, okay? - You want my number? - Yes, I get your number. - Okay. - After you get the number just Rashford celebration. - Do you remember my name? - Yes. [Sidemen laughing] - It's okay. Are we gonna name the\nlittle sheep together? - Yeah. Yeah. His name is Timothy. - Timothy the Little Lamb. [Sidemen laughing] - Now walk off. - Now walk off. [Sidemen laughing] - Oh, bye. Nice meeting you. - Run back on and grab the lamb, then run off. [Sidemen laughing] - Where's my hug? You smelled my boob on the ball. That's not fair. [Sidemen applauding] - I can't believe she scored against you. - Yeah, that was crazy. - It was offside. - How do you think your date went? - I actually had fun, to be honest. I really was scared of him barking at me. So I'm really glad that\nthat didn't happen. - I should have barked at her. - I thought it was quite fun. There was a little bit\nof chemistry for a second and then he cheated. And I'm not about cheating, so. But that's fine. He's got my number, so I hope he calls. - Oh. - She was into you, man. - Would you go on a second date with Speed? - Absolutely. - No, you seen that? [Sidemen laughing] Tobi, you see that? - Control it with your tits. [Sidemen laughing] - Speed. - Yes. - Listen up, buddy. We want you to be a yoga instructor. Get her involved. Do a whole class with her. Start showing her all\nthe poses that you know. - We might give you some poses, as well. - Do you want your\nphone to get the number? - Yeah, I do need my phone. [Sidemen laughing] Why did you flinch? I don't wanna touch that thing. [Sidemen laughing] He thought I wanted to touch his penis. - This is so funny. - Stop. - Okay. - Hey. - Hello. - So, today, this is the Speed Yoga Class. Okay? - Yoga, okay. - Straight in. - So, first off... - Downward dog. - This is called, one of my friends made it, his name is Benzie. You know Benzie? - No. - Benzie. - It's called the doggy downward, okay. Come down. - Yeah. - Okay, bring over. Okay, bring over. - Bring over. - Okay, give it three more seconds for the back vertergree. [Sidemen laughing] Okay. Come up. Come up. Come up. Come up. Come up. Okay. Good job. Let it loose.", "3596.466 - 3896.719": "- Why has that come to your brain? - Now next one is the Celezio Dego. - Oh, I haven't heard of that one yet. - Yeah, it's French-Turkish. - Okay. - Get down on your palms. And what you have to do is put your head down like that. - On the floor? - Yes. Yes. - Oh, my God. - Wow, you can actually do it? - Where's your flexibility? - Can you push it? - I don't wanna hurt you, though. - Start groaning. [Speed groaning] - More? - More. - Oh. Oh, f*ck. - You good? - More, more, more. - He's shaking his legs. - Oh, f*ck. - All right, new pose. - I'm dying. - All right, now we're doing a pose, okay. - Okay. - Do the sexy octopus. - Now this is called\nthe sexy octopus, okay. - Ooh. - So it's kind of a weird pose. So you gotta like get low since octopus got like\neight fingers and sh*t. [Sidemen laughing] You have to like- Yeah. Do this. Yep. - Yeah. - That feel good. Damn, why does this feel good? - Dunno. - Now the next one is... - The Squidward. - The Squidward. - SpongeBob? - Yeah. SpongeBob. So the episode where\nhe's doing all that sh*t, doing ballet and sh*t. So yeah, you do that and you twist, turn around, you twist and you twist and you bark. - And I bark? - Yeah. [Sophie barking] - No. Louder. - Tell her it's a serious yoga lesson, no barking. It really annoys you. - God damnit! This is a serious f*cking yoga lesson. No barking. It distracts me. - All right, do the Kai Cenat. Let's try that. - All right. Now this one here is the Kai Cenat. Okay? So you go, word to my mother. [Sidemen laughing] Word to my mother. - Word to my mother. - Water mamma. - Word to my mother. - Yeah. - Okay. - Word to my mother. - All right, now let's try the XQC. - Now let's try the XQC, okay. - The what? - The XQC. It's different. - Okay. [Speed babbling] - Okay? [Sophie babbling] Okay. That's not bad. Then two more times. [Speed babbling] [Sophie babbling] One more time. [Speed babbling] [Sophie babbling] - That was fantastic. You're learning. - Fantastic. You're learning now. - Go for the number. Ask if she wants to book another lesson. - If you wanna book another lesson, hey, put your number in. - I need the lesson number two. - Yeah, yeah, yeah, yeah, yeah. - Needs to be done. - We must all be so clapped, by the way. - Are we ugly? - No, we are, we are. - There you go. Okay. I have your number. - Do you know how hard it was for us when we were 18, bruv? - I was fat and a virgin. - 18, 19. - You wanna go again? - No. - Gimme a second chance. [Sidemen laughing] - Thank you so much for the yoga lesson. - See you next time. Thank you. - See you next time. - But the second chance\nwouldn't change it. I would still be ugly. - You a good looking man. - I'm not, I've got lazy eye. Don't zoom in on it. Don't zoom in on it. - So how do you think your date went? - It was a very interesting date. Never been on a date like that. But you know, it was actually kind of cool. He is very energetic and very outgoing person and I'm the same. So I think we matched our energies and I think we're both very similar in that aspect. - Similar? - Would you go on a second date? - Yeah. - She'd go on a second. - I would, to see what else would happen. - And did you put your actual real number in the phone? - Yeah, I did. - f*ckin' hell, you're that guy, you know? - I'm too good, bro. - You are him. - I didn't miss one. - You missed one. - You missed one. - But I got her number. - He did. - Oh, sh*t. - \"I've giving my number\nlike I'm a wasteman.\" - I'm too good, bro. I'm sorry. It don't matter what y'all do. - Next date, two girls. - There's no way you can\nget two numbers at once. - That's actually crazy. You know what? Yeah. - I can do that. - Two numbers, though. You gotta leave with both numbers. - Okay. I can do that. Come on. I'm back. - Hello. - Like you never left. - Back like I'm never left. So how are you ladies are today? [Sidemen laughing] - Good, thank you. I like the socks. - You like the socks? - Yeah. - Okay, fair enough. Okay, if I'm not mistaken, you're from North London and Lessix-Dessix? - Lessix? - Whatever. Bessix-Fessix. - Yeah. - Okay. And you're from- - I think you mistook me for another girl, but Luton. - That's what I said. - You said North London. - Wait, you're from Luton? - Wait, you're from Luton? - Yeah. Oh, you know where it is? - Damn, that place sucks. - Heard up there sucks, like, sucks ass. Sucks ass up there. - No, it's great. It's cultured. It's got everything you need. - It's got an airport. - Yeah. - It's only good for easyJet. - It's only good for easyJet, though. - And Ryanair.", "3896.719 - 4195.264999999999": "- What would you do if\nyou took me on a date? - Are you a stay at home or a go out person? - Whatever you want. - Whatever you want. - Oh, I'm gonna say a cooked meal if you like staying at home. - Oh, I'm bored. I'm gonna ask the other one. - You know what, I'm gonna ask the other one. Okay. If you could take me on a date, where are you taking me? - We can play football. You like football? - Oh, my God. Turn towards her. - Oh, my God. Oh, my God. So what position are we playing? - Well, a penalty shoot-out. A penalty shoot-out. - Oh, so you're goalie\nand I'm the taker or? - We can switch. - Turn to the other girl and say, \"She's got W rizz.\" - She's got W rizz. She's got W rizz. What the hell? - Carry on talking about football. - What's your favourite team? - I'm not a football fan. Sorry. - What's your favourite team? - I'm gonna have to say Liverpool. I'm sorry. - That's disgusting. - That's disgusting. - Yeah, I'm sorry. - Liverpule. - Liverpule. - All right. How many pushups can you do? - How many pushups can you do? - Maybe like five. [Speed scoffs] - How many push ups can you do? - I'm gonna have to say zero. How many can you do? - I can do six. And then do them. - I can do six. - Go on. That is not a push up. - That is not a push up. - Are you serious? - That is not a push up. - Are you serious? - Do you wanna see me twerk? - You wanna see me twerk? - Go for it. - Gosh, you're showing us everything. - I like your little dance you do. - Go ahead. [upbeat music] Don't kill 'em now. - He's killing them. - I respect him, man. I wish my hips moved like that, man. - Are y'all taking me as a joke? - No. - No, that was really, really nice. Can you please do it again? - More energy this time. - More energy. More energy. [upbeat music] - How bad do you want it? - You even got a lap dance. - Yeah, wow. [Sidemen laughing] - I dunno what to say to him. - Would you guys be down for a threesome? - Okay. Now the real question is, would you guys be down for a threesome? - Come on. - Come on. - Oh, this is awkward. - You're slightly young, unfortunately. - I'm 28. - I'm 28. What the hell? How's that young? - Oh, wow. - Okay. Yeah. - Oh, so a threesome? - I mean, if you man do it, I'll do it. [upbeat music] - Get the number. Get the number. - So, three? - Yeah, absolutely. - Okay. - Well, lemme get the number, then, okay. - Sure. Absolutely. Getting everybody's numbers, yeah? - Yeah, yeah. No, no. The first two girls numbers I got. - He just said the first\ntwo numbers he's got. This guy has cooked the entire room. - All right, well played, you win. d*ckhead. - What's my name? What's my name? - Do the Rashford. - This is gonna be the\nbest threesome ever. - Yeah. [Sidemen laughing] - And then walk out like that. - And then walk out like that. [Sidemen laughing] - Nice. - See ya. - Bye. - What a guy. [Sidemen applauding] - He's cooked! - That's why he's the GOAT. - Well played, bro. Well f*cking played, man. - How? I don't know. - I really don't understand it. - It's just too easy, bro. See, if Vicki did that. [Sidemen laughing] \"Oh, my God!\" - That's not very nice. - All right, Speed, this date, you've just gotta be\nthe best at everything. You've just gotta talk\nabout how good you are, how great you are. Don't even ask her anything. Just talk about everything you've done. - Ask her job and then\nlaugh when she says it. - Oh, my God. - So I gotta be a jackass. - Yeah. - If you end up with her number after this then something ain't right. - Bro is sweating, by the way. I'm wet. I am wet. - He's talking sh*t about you. I wouldn't take it. [Sidemen laughing] - Hey, how's it going? - Hey, baby. I like your socks. - Here he comes. Coming in hot. - Are we handshaking? - No, I mean, we can hug. - Oh, that's a lot of sweat. - Okay. So how are you? - I'm good. How are you? - I'm actually fine. I'm doing well, you know. - Having a great time? - Having a great time. - I'm pretty good at being a d*ckhead. - What do you do for a living? - I do social media. - How many followers do you have? - How many followers do you have? - On Instagram? Like 57k, I think. - Laugh. - Kind of small. - Pity numbers. [Sidemen laughing] - Basic. I need to get 'em up. Got any tips? - Got any tips? You know, you just have to be the best. You have to be the great. - Just don't be you. - Just don't be you, you know. - Don't be me? - Yeah. - You said that way too quick. - 57k, them are peasant numbers. Holy sh*t. - Damn. - I've got a lot of followers. - Because I have a lot of followers. - Do you know who I am? - You do, yeah. - Do you know who I am?", "4195.264999999999 - 4495.098": "- Do you know who I am? - I do. Yeah. - Of course you do. Everyone knows who I am. - Of course you do because everybody knows\nwho I am, you jackass. [Sidemen laughing] - Look at his foot. - I do that. Don't judge. - That's a Vikkstar pose, that is. - Look, I like to know who I'm dating. - Of course. - So why are you? - Why are you? - Who am I? - No, like, what are you? - No, what are you? - What am I? - Yes. - A woman. - You sure? [Sidemen laughing] - Last time I checked, yeah. - Last time you checked? - Yeah. Do you want me to prove it? - Just say, \"Lemme tell you about me,\" and then list all your achievements. - Lemme tell you about me, though, okay. - Okay, go for it. - I'm the black man who met Ronaldo. - You are, yes. - I am the man who met KSI. I am the man who met Simon. I am the guy. - Talk about how many\npeople watch your streams. - Thousands of people watches my streams. - Yeah. - I am that guy. - Okay. - Thousand of people watching\nmy stream on YouTube. Stream every day, make videos on YouTube. - I'm impressed. Yeah. - Millions of subscribers. - Oh, yeah. - Millions of Instagram followers and Twitter followers. - You getting close. - What are you? [Sidemen laughing] - I'm myself. - Do you understand how rich I am? - No. - Like if I said I wanted to buy you, I could buy you. [Sidemen laughing] - You want to buy me? - No. Hypothetically, if I'm speaking. - Simon has left the building. - Hypothetically, I think I'd cost quite a bit, baby. - How much you cost? - At least, like, a double cheeseburger and a Sprite. - So when do you get interesting? - So when do you get interesting? Like, we've been talking for the past five minutes and nothing has been interesting. - Gimme something that's interesting. - Gimme something that's\ninteresting about you. Like, I'm waiting. - Do you want me to\nshow you a magic trick? - Go on, then. - Okay. Are you ready? Are you ready for this? - Yes. Whoa! [Sidemen laughing] - I don't skip upper body day, baby. - Get her to punch him. - It's 'cause they're like really real so they just do that by themselves. Like, battery operated. - You know what? This is turning me on. - You know what? This is turning me on. - Is it? I like that. - I want you to punch me in the stomach. - I want you to punch me in the stomach. - Punch you? - Yeah. - Are you sure? - This is gonna come with venom. - I like that sh*t. - Okay, are we gonna stand up? - I like that sh*t. - Okay. - She's gonna wind him. We might've set him up quite badly. - I need to warm up. - Why is she squatting in a skirt? - Not too hard. Not too hard. - Not too hard? - Something gentle, you know. - Really gentle? - Yes. - That was so good. - Oh, that was so good. - You like that? - She's a dom', bro. She's a dom', bro. The way she's speaking to him, she's a dom', bro. - KSI is living vicariously through him, by the way. - Oh, yeah. Harder. - Harder? - Okay. [Sidemen laughing] - Guys, what's going on? - JJ got locked in a bubble. - Am I making you nervous? - You are kind of making me nervous. - Yeah, I can tell. - Yeah. - A cute thing going on. - Yeah, we kinda do have\na cute thing going on. - Yeah. - Shoot, you know. - What the f*ck is happening? - Lemme whisper in your ear. - No, don't bark in her ear. - First let me whisper something in your ear, okay? - Okay. - I'm better than you. - I'm better than you. [Sidemen laughing] - Yeah, I think I'm your match. I think I'm better than you, you know. - What have we created? - Really? - Yeah. - Stop leaning back and\nenjoying it too much. - Oh, you're better than me, huh? [Sidemen laughing] - Get the mic off him. - Oh, you're better than me, huh? - Wait, my face is on your face. - Wait, what? - What's happening? - You know what? I want to see how good you really are. - Bro, what are you directing? - Dinosaur. [Speed roaring] Pause. [Lowri roaring] Freeze. - What are you trying to be right now? [Sidemen laughing] God, you actually scared\nthe sh*t out of me. - Go down and just lifting him out. Just go down and lift him out. - Yeah, go on, then. - JJ's coming. Just stay frozen. - Guess I'll just take a seat, then. - I'm sorry. I think he's malfunctioned. - He's broken. He needs to be put on charge. - Yeah. - It's that battery. Yeah. Oh, okay. - Great to see you, though. - Well, bye, daddy. - Bye, mummy. [Sidemen laughing] - That nearly got really weird. That did get really weird. - It was weirder here, bro. Bro was there moaning\nthinking we didn't notice. - I imagine he wants your phone number. - Okay. - Yeah. How's your day? - Yeah, it's been all right, yeah. - Cool."}